## Python - Data I/O
<ul>
    <li>CSV</li>
    <li>Excel</li>
    <li>HTML</li>
    <li>SQL</li>
</ul>

In [2]:
import pandas as pd

In [3]:
data = pd.DataFrame({'a':[0,4,8,12],
                    'b':[1,5,9,13],
                    'c':[2,6,10,14],
                    'd':[3,7,11,15]})

In [4]:
data

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
data.to_csv('new',index=False)

In [14]:
df = pd.read_csv('new')

In [15]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
dt = pd.read_html('http://www.nepalstock.com/todaysprice')

In [9]:
type(dt)

list

In [11]:
dt[0].head()

,0,1,2,3,4,5,6,7,8,9
0,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...,As of 2020-03-22 16:00:00 Select Date Stock ...
1,S.N.,Traded Companies,No. Of Transaction,Max Price,Min Price,Closing Price,Traded Shares,Amount,Previous Closing,Difference Rs.
2,1,Agriculture Development Bank Limited,35,376.00,362.00,368.00,5639.00,2049363.00,376.00,-8.00
3,2,Api Power Company Ltd.,13,116.00,104.00,116.00,2980.00,319130.00,108.00,8.00
4,3,Arun Kabeli Power Ltd.,2,112.00,111.00,112.00,110.00,12309.00,113.00,-1.00

In [12]:
from sqlalchemy import create_engine

In [13]:
engine = create_engine('sqlite:///:memory:')

In [16]:
df.to_sql('tbl_new',engine)

In [17]:
sqldf = pd.read_sql('tbl_new',con=engine)

In [18]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15